<a href="https://colab.research.google.com/github/RevatiJagdale/ML-experiments/blob/main/Pandas_Day_1_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# PANDAS - Python Data Analysis Library

- Open Source
- Inspired from Numpy

- Panda processing data which helps in data analysis
- It provides functions and methods to efficiently manipulate large datasets
- Used for analysis and cleaning

In [ ]:
# Dictionary in python : Keys, values, ordered/paired data

In [ ]:
# List in pyton : multiple items in a single variable

In [ ]:
##Name , Age and marks of 4 students

In [ ]:
data = {"Name":['Tom','Nick','Krish','Jack'],"Age":[20,19,18,15],"Marks":[50,75,83,65]}
data

{'Name': ['Tom', 'Nick', 'Krish', 'Jack'],
 'Age': [20, 19, 18, 15],
 'Marks': [50, 75, 83, 65]}

In [ ]:
# Loading the library

In [ ]:
import pandas as pd

In [ ]:
import pandas

### Converting a dictionary to a dataframe
##### DataFrame - 2D data structure, which shows the data in a tabular form of rows and columns

In [ ]:
# Syntax: pd.DataFrame

In [ ]:
df = pd.DataFrame(data)

In [ ]:
df

    Name  Age  Marks
0    Tom   20     50
1   Nick   19     75
2  Krish   18     83
3   Jack   15     65

 Try : Create a dictionary with Name, Degree and Score of 35 Students and convert this to a dataframe

In [ ]:
# Load a dataset into Python
# Syntax: pd.read_csv - Comma separated values
## pd.read_excel for xlsx files

In [ ]:
employee = pd.read_csv(r"C:\Users\nayanamenon1\OneDrive - KPMG\Desktop\Employee Details.csv")

In [ ]:
employee

      ID              Name   Age   Salary             Department
0   1106   Manisha Preethi  33.0  92546.0     Business Analytics
1   1092    Rajni Jagadish  34.0  65924.0          Manufacturing
2   1631      Vasu Sanjeev  23.0  42885.0  Management Consulting
3   1936  Mariela Mcmillan  28.0  94363.0                  Sales
4   1464  Alana Washington  35.0  83573.0     Business Analytics
5   1245    Sidney Ballard  37.0  33852.0  Management Consulting
6   1997    Esmeralda Mann   NaN  48713.0                  Sales
7   1955    Elian Bartlett  28.0  56757.0     Business Analytics
8   1251      Zion Huffman  33.0  31007.0                    NaN
9   1286     Lailah Kaiser  32.0  48899.0     Business Analytics
10  1739    Jaidyn Patrick  31.0  28685.0             Accounting
11  1711      Steve Duarte  37.0      NaN        Human Resources
12  1906   Kaleigh Wiggins  23.0  85430.0     Business Analytics
13  1437     Teagan Mullen  29.0  80120.0             Accounting
14  1319  Moriah Armstrong  23.0  53021.0                    NaN
15  1568     Dominic Huang  38.0  51077.0          Manufacturing
16  1303     Deven Wallace   NaN  81215.0          Manufacturing
17  1584      Yahir Levine   NaN  57417.0                  Sales
18  1553     Shayla Landry  35.0  32618.0          Manufacturing
19  1493        Judah Wong   NaN  86820.0             Accounting
20  1094        Jade Lynch  37.0  68054.0        Human Resources
21  1144   Dereon Sheppard  31.0      NaN          Manufacturing
22  1781     Kimora Phelps  30.0      NaN     Business Analytics
23  1600    Estrella Nunez   NaN  41895.0        Human Resources
24  1450  Johnathan Ortega  31.0  40065.0     Business Analytics
25  1883      Kyla Farrell  23.0  27867.0        Human Resources
26  1068      Kimora Lucas  37.0  44024.0                    NaN
27  1588     Alyvia Ramsey  35.0  90506.0        Human Resources
28  1268     Madalynn Ruiz  28.0  86144.0                  Sales
29  1411    Ashly Peterson  29.0  77059.0     Business Analytics
30  1577  Gabriel Thornton  39.0      NaN                    NaN
31  1139   Elaine Santiago  24.0  85798.0                  Sales
32  1772   Makenzie Herman  31.0  71262.0             Accounting

In [ ]:
# To view the first 5 rows of the dataset
# head()

In [ ]:
employee.head() # By default python gives the first 5 rows

     ID              Name   Age   Salary             Department
0  1106   Manisha Preethi  33.0  92546.0     Business Analytics
1  1092    Rajni Jagadish  34.0  65924.0          Manufacturing
2  1631      Vasu Sanjeev  23.0  42885.0  Management Consulting
3  1936  Mariela Mcmillan  28.0  94363.0                  Sales
4  1464  Alana Washington  35.0  83573.0     Business Analytics

In [ ]:
#To view the last 5 rows of the dataset

In [ ]:
employee.tail()

      ID              Name   Age   Salary          Department
28  1268     Madalynn Ruiz  28.0  86144.0               Sales
29  1411    Ashly Peterson  29.0  77059.0  Business Analytics
30  1577  Gabriel Thornton  39.0      NaN                 NaN
31  1139   Elaine Santiago  24.0  85798.0               Sales
32  1772   Makenzie Herman  31.0  71262.0          Accounting

In [ ]:
# To view the first 3
employee.head()

     ID              Name   Age   Salary             Department
0  1106   Manisha Preethi  33.0  92546.0     Business Analytics
1  1092    Rajni Jagadish  34.0  65924.0          Manufacturing
2  1631      Vasu Sanjeev  23.0  42885.0  Management Consulting
3  1936  Mariela Mcmillan  28.0  94363.0                  Sales
4  1464  Alana Washington  35.0  83573.0     Business Analytics

In [ ]:
# Try for the first 12 rows and last 8 rows separately
employee.head(12),employee.tail(8)

(      ID              Name   Age   Salary             Department
 0   1106   Manisha Preethi  33.0  92546.0     Business Analytics
 1   1092    Rajni Jagadish  34.0  65924.0          Manufacturing
 2   1631      Vasu Sanjeev  23.0  42885.0  Management Consulting
 3   1936  Mariela Mcmillan  28.0  94363.0                  Sales
 4   1464  Alana Washington  35.0  83573.0     Business Analytics
 5   1245    Sidney Ballard  37.0  33852.0  Management Consulting
 6   1997    Esmeralda Mann   NaN  48713.0                  Sales
 7   1955    Elian Bartlett  28.0  56757.0     Business Analytics
 8   1251      Zion Huffman  33.0  31007.0                    NaN
 9   1286     Lailah Kaiser  32.0  48899.0     Business Analytics
 10  1739    Jaidyn Patrick  31.0  28685.0             Accounting
 11  1711      Steve Duarte  37.0      NaN        Human Resources,
       ID              Name   Age   Salary          Department
 25  1883      Kyla Farrell  23.0  27867.0     Human Resources
 26  1068      Kimora Lucas  37.0  44024.0                 NaN
 27  1588     Alyvia Ramsey  35.0  90506.0     Human Resources
 28  1268     Madalynn Ruiz  28.0  86144.0               Sales
 29  1411    Ashly Peterson  29.0  77059.0  Business Analytics
 30  1577  Gabriel Thornton  39.0      NaN                 NaN
 31  1139   Elaine Santiago  24.0  85798.0               Sales
 32  1772   Makenzie Herman  31.0  71262.0          Accounting)

In [ ]:
# Indentifying the total number of rows and columns in the data

In [ ]:
employee.shape

(33, 5)

In [ ]:
# Information about the data
employee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          33 non-null     int64
 1   Name        33 non-null     object
 2   Age         28 non-null     float64
 3   Salary      29 non-null     float64
 4   Department  29 non-null     object
dtypes: float64(2), int64(1), object(2)
memory usage: 1.4+ KB

In [ ]:
## Information tells how man Non-null values are present in each column

In [ ]:
# To find if there are any missing values in the data
## We will use the isnull() function

employee.isnull().any()

NameError: name 'employee' is not defined

In [ ]:
# Removing the null values
# Syntax: dropna()
new_employee = employee.dropna()

In [ ]:
new_employee

      ID              Name   Age   Salary             Department
0   1106   Manisha Preethi  33.0  92546.0     Business Analytics
1   1092    Rajni Jagadish  34.0  65924.0          Manufacturing
2   1631      Vasu Sanjeev  23.0  42885.0  Management Consulting
3   1936  Mariela Mcmillan  28.0  94363.0                  Sales
4   1464  Alana Washington  35.0  83573.0     Business Analytics
5   1245    Sidney Ballard  37.0  33852.0  Management Consulting
7   1955    Elian Bartlett  28.0  56757.0     Business Analytics
9   1286     Lailah Kaiser  32.0  48899.0     Business Analytics
10  1739    Jaidyn Patrick  31.0  28685.0             Accounting
12  1906   Kaleigh Wiggins  23.0  85430.0     Business Analytics
13  1437     Teagan Mullen  29.0  80120.0             Accounting
15  1568     Dominic Huang  38.0  51077.0          Manufacturing
18  1553     Shayla Landry  35.0  32618.0          Manufacturing
20  1094        Jade Lynch  37.0  68054.0        Human Resources
24  1450  Johnathan Ortega  31.0  40065.0     Business Analytics
25  1883      Kyla Farrell  23.0  27867.0        Human Resources
27  1588     Alyvia Ramsey  35.0  90506.0        Human Resources
28  1268     Madalynn Ruiz  28.0  86144.0                  Sales
29  1411    Ashly Peterson  29.0  77059.0     Business Analytics
31  1139   Elaine Santiago  24.0  85798.0                  Sales
32  1772   Makenzie Herman  31.0  71262.0             Accounting

In [ ]:
new_employee.isnull().any()

ID            False
Name          False
Age           False
Salary        False
Department    False
dtype: bool

In [ ]:
# Removing the null values
# Loading the dataset to python
# Creating a dataframe
# Finding the information about the dataset
# head and tail
# shape of the data

#### Descriptive Statistics

In [ ]:
# Describe the dataset statistically

employee.describe()

                ID        Age        Salary
count    33.000000  28.000000     29.000000
mean   1495.484848  31.214286  61641.241379
std     280.014522   4.954288  22113.925580
min    1068.000000  23.000000  27867.000000
25%    1268.000000  28.000000  42885.000000
50%    1493.000000  31.000000  57417.000000
75%    1711.000000  35.000000  83573.000000
max    1997.000000  39.000000  94363.000000

In [ ]:
# Try and get the descriptive statistics for new employee

In [ ]:
new_employee['Salary'].describe()

count       21.000000
mean     63975.428571
std      23090.225853
min      27867.000000
25%      42885.000000
50%      68054.000000
75%      85430.000000
max      94363.000000
Name: Salary, dtype: float64

### Operations using Pandas

In [ ]:
# Getting the average of a particular column

31.214285714285715

In [ ]:
print(round(avg_age,2))

31.21

In [ ]:
# Try finding the avg salary upto 4 decimals

In [ ]:
avg_salary = employee['Salary'].mean()
round(avg_salary,4)

61641.2414

In [ ]:
# Minimum and Maximum values of Age
employee['Age'].min()

23.0

In [ ]:
employee['Age'].max()

39.0

In [ ]:
# Find Min and max of salary

In [ ]:
employee['Salary'].max()

94363.0

In [ ]:
# Python is case sensitive

In [ ]:
# Finding the median of salary
median_sal = employee['Salary'].median()

In [ ]:
median_sal

57417.0

In [ ]:
 # Try finding the median of Age

In [ ]:
employee.head()

     ID              Name   Age   Salary             Department
0  1106   Manisha Preethi  33.0  92546.0     Business Analytics
1  1092    Rajni Jagadish  34.0  65924.0          Manufacturing
2  1631      Vasu Sanjeev  23.0  42885.0  Management Consulting
3  1936  Mariela Mcmillan  28.0  94363.0                  Sales
4  1464  Alana Washington  35.0  83573.0     Business Analytics

In [ ]:
# To count the employees in each department
## Syntax: value_counts()

Business Analytics       8
Manufacturing            5
Human Resources          5
Sales                    5
Accounting               4
Management Consulting    2
Name: Department, dtype: int64

In [ ]:
# Filling the NA values with the median
## Syntax : fillna

In [ ]:
employee['Salary'] = employee['Salary'].fillna(employee['Salary'].median())

In [ ]:
m = employee['Salary']

In [ ]:
employee['Salary'].isnull().any()

False

In [ ]:
# Fill the missing ages with the median age
## Filling the missing departments with Sales

In [ ]:
# Adding a new row to the dataset

In [ ]:
employee.columns

Index(['ID', 'Name', 'Age', 'Salary', 'Department'], dtype='object')

In [ ]:
emp_dict = {'ID':[2001,2006,2008,2015],'Name':['Amy','Jerry','Ram','Sita'],
           'Age':[32,44,43,44],'Salary':[25000,13450,32145,12342],'Department':['Sales','Analytics','Data Science','Sales']}
emp_dict

{'ID': [2001, 2006, 2008, 2015],
 'Name': ['Amy', 'Jerry', 'Ram', 'Sita'],
 'Age': [32, 44, 43, 44],
 'Salary': [25000, 13450, 32145, 12342],
 'Department': ['Sales', 'Analytics', 'Data Science', 'Sales']}

In [ ]:
emp_df = pd.DataFrame(emp_dict)
emp_df

     ID   Name  Age  Salary    Department
0  2001    Amy   32   25000         Sales
1  2006  Jerry   44   13450     Analytics
2  2008    Ram   43   32145  Data Science
3  2015   Sita   44   12342         Sales

In [ ]:
employee.head()

     ID              Name   Age   Salary             Department
0  1106   Manisha Preethi  33.0  92546.0     Business Analytics
1  1092    Rajni Jagadish  34.0  65924.0          Manufacturing
2  1631      Vasu Sanjeev  23.0  42885.0  Management Consulting
3  1936  Mariela Mcmillan  28.0  94363.0                  Sales
4  1464  Alana Washington  35.0  83573.0     Business Analytics

In [ ]:
# Adding the new row into the datset
## Syntax: concat() - concatinanting / combining

In [ ]:
emp_full = pd.concat([employee,emp_df],axis=0)

In [ ]:
emp_full.head()

     ID              Name   Age   Salary             Department
0  1106   Manisha Preethi  33.0  92546.0     Business Analytics
1  1092    Rajni Jagadish  34.0  65924.0          Manufacturing
2  1631      Vasu Sanjeev  23.0  42885.0  Management Consulting
3  1936  Mariela Mcmillan  28.0  94363.0                  Sales
4  1464  Alana Washington  35.0  83573.0     Business Analytics

In [ ]:
emp_full

      ID              Name   Age   Salary             Department
0   1106   Manisha Preethi  33.0  92546.0     Business Analytics
1   1092    Rajni Jagadish  34.0  65924.0          Manufacturing
2   1631      Vasu Sanjeev  23.0  42885.0  Management Consulting
3   1936  Mariela Mcmillan  28.0  94363.0                  Sales
4   1464  Alana Washington  35.0  83573.0     Business Analytics
5   1245    Sidney Ballard  37.0  33852.0  Management Consulting
6   1997    Esmeralda Mann   NaN  48713.0                  Sales
7   1955    Elian Bartlett  28.0  56757.0     Business Analytics
8   1251      Zion Huffman  33.0  31007.0                    NaN
9   1286     Lailah Kaiser  32.0  48899.0     Business Analytics
10  1739    Jaidyn Patrick  31.0  28685.0             Accounting
11  1711      Steve Duarte  37.0  57417.0        Human Resources
12  1906   Kaleigh Wiggins  23.0  85430.0     Business Analytics
13  1437     Teagan Mullen  29.0  80120.0             Accounting
14  1319  Moriah Armstrong  23.0  53021.0                    NaN
15  1568     Dominic Huang  38.0  51077.0          Manufacturing
16  1303     Deven Wallace   NaN  81215.0          Manufacturing
17  1584      Yahir Levine   NaN  57417.0                  Sales
18  1553     Shayla Landry  35.0  32618.0          Manufacturing
19  1493        Judah Wong   NaN  86820.0             Accounting
20  1094        Jade Lynch  37.0  68054.0        Human Resources
21  1144   Dereon Sheppard  31.0  57417.0          Manufacturing
22  1781     Kimora Phelps  30.0  57417.0     Business Analytics
23  1600    Estrella Nunez   NaN  41895.0        Human Resources
24  1450  Johnathan Ortega  31.0  40065.0     Business Analytics
25  1883      Kyla Farrell  23.0  27867.0        Human Resources
26  1068      Kimora Lucas  37.0  44024.0                    NaN
27  1588     Alyvia Ramsey  35.0  90506.0        Human Resources
28  1268     Madalynn Ruiz  28.0  86144.0                  Sales
29  1411    Ashly Peterson  29.0  77059.0     Business Analytics
30  1577  Gabriel Thornton  39.0  57417.0                    NaN
31  1139   Elaine Santiago  24.0  85798.0                  Sales
32  1772   Makenzie Herman  31.0  71262.0             Accounting
0   2001               Amy  32.0  25000.0                  Sales
1   2006             Jerry  44.0  13450.0              Analytics
2   2008               Ram  43.0  32145.0           Data Science
3   2015              Sita  44.0  12342.0                  Sales

In [ ]:
emp_full = pd.concat([employee,emp_df],axis=0,ignore_index=True)

In [ ]:
emp_full

      ID              Name   Age   Salary             Department
0   1106   Manisha Preethi  33.0  92546.0     Business Analytics
1   1092    Rajni Jagadish  34.0  65924.0          Manufacturing
2   1631      Vasu Sanjeev  23.0  42885.0  Management Consulting
3   1936  Mariela Mcmillan  28.0  94363.0                  Sales
4   1464  Alana Washington  35.0  83573.0     Business Analytics
5   1245    Sidney Ballard  37.0  33852.0  Management Consulting
6   1997    Esmeralda Mann   NaN  48713.0                  Sales
7   1955    Elian Bartlett  28.0  56757.0     Business Analytics
8   1251      Zion Huffman  33.0  31007.0                    NaN
9   1286     Lailah Kaiser  32.0  48899.0     Business Analytics
10  1739    Jaidyn Patrick  31.0  28685.0             Accounting
11  1711      Steve Duarte  37.0  57417.0        Human Resources
12  1906   Kaleigh Wiggins  23.0  85430.0     Business Analytics
13  1437     Teagan Mullen  29.0  80120.0             Accounting
14  1319  Moriah Armstrong  23.0  53021.0                    NaN
15  1568     Dominic Huang  38.0  51077.0          Manufacturing
16  1303     Deven Wallace   NaN  81215.0          Manufacturing
17  1584      Yahir Levine   NaN  57417.0                  Sales
18  1553     Shayla Landry  35.0  32618.0          Manufacturing
19  1493        Judah Wong   NaN  86820.0             Accounting
20  1094        Jade Lynch  37.0  68054.0        Human Resources
21  1144   Dereon Sheppard  31.0  57417.0          Manufacturing
22  1781     Kimora Phelps  30.0  57417.0     Business Analytics
23  1600    Estrella Nunez   NaN  41895.0        Human Resources
24  1450  Johnathan Ortega  31.0  40065.0     Business Analytics
25  1883      Kyla Farrell  23.0  27867.0        Human Resources
26  1068      Kimora Lucas  37.0  44024.0                    NaN
27  1588     Alyvia Ramsey  35.0  90506.0        Human Resources
28  1268     Madalynn Ruiz  28.0  86144.0                  Sales
29  1411    Ashly Peterson  29.0  77059.0     Business Analytics
30  1577  Gabriel Thornton  39.0  57417.0                    NaN
31  1139   Elaine Santiago  24.0  85798.0                  Sales
32  1772   Makenzie Herman  31.0  71262.0             Accounting
33  2001               Amy  32.0  25000.0                  Sales
34  2006             Jerry  44.0  13450.0              Analytics
35  2008               Ram  43.0  32145.0           Data Science
36  2015              Sita  44.0  12342.0                  Sales

 Try out all the functions for the Ecommerce dataset